index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ro" xml:lang="ro">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Tehnici Avansate de Programare</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Petru Rebeja" />
<meta name="description" content="Pagina cursului Technici Avansate de Programare. Facultatea de Matematică, Universitatea Alexandru Ioan Cuza, Iași."
 />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Tehnici Avansate de Programare</h1>
<div id="table-of-contents">
<h2>Cuprins</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#prezentare">Prezentare</a></li>
<li><a href="#fisa-disciplinei">Fișa disciplinei</a>
<ul>
<li><a href="#date-despre-program">Date despre program</a></li>
<li><a href="#date-despre-disciplina">Date despre disciplină</a></li>
<li><a href="#evaluare">Evaluare</a>
<ul>
<li><a href="#orgab26d44">Standard minim de performanță:</a></li>
</ul>
</li>
<li><a href="#bibliografie">Referințe bibliografice</a></li>
</ul>
</li>
<li><a href="#contact">Date de contact</a>
<ul>
<li><a href="#marius-apetrii">Marius Apetrii</a>
<ul>
<li><a href="#orgcf2da56">Email</a></li>
</ul>
</li>
<li><a href="#petru-rebeja">Petru Rebeja</a>
<ul>
<li><a href="#org3ac3cab">Email</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#s01">Săptămâna 01</a>
<ul>
<li><a href="#s01-curs">Curs</a></li>
</ul>
</li>
<li><a href="#links">Legături utile</a></li>
</ul>
</div>
</div>
<div id="outline-container-prezentare" class="outline-2">
<h2 id="prezentare">Prezentare</h2>
<div class="outline-text-2" id="text-prezentare">
<p>
Cursul <b>Tehnici Avansate de Programare</b> își propune să faciliteze să ofere pregătirea necesară pentru studenții Facultății de Matematică în vederea urmării unei cariere în domeniul IT.
</p>

<p>
  Pe parcursul cursului studenții vor acumula un set de bune practici pentru dezvoltarea produselor software pe care le vor aplica lucrând în echipe la dezvoltarea unei aplicații Web.
Aplicația va fi propusă de către membrii echipei.
</p>
</div>
</div>
<div id="outline-container-fisa-disciplinei" class="outline-2">
<h2 id="fisa-disciplinei">Fișa disciplinei</h2>
<div class="outline-text-2" id="text-fisa-disciplinei">
</div>
<div id="outline-container-date-despre-program" class="outline-3">
<h3 id="date-despre-program">Date despre program</h3>
<div class="outline-text-3" id="text-date-despre-program">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Instituția de învățământ</td>
<td class="org-left">Universitatea „Alexandru Ioan Cuza” din Iași</td>
</tr>

<tr>
<td class="org-left">Facultatea</td>
<td class="org-left">Facultatea de Matematică</td>
</tr>

<tr>
<td class="org-left">Departamentul</td>
<td class="org-left">Matematică</td>
</tr>

<tr>
<td class="org-left">Domeniul de studii</td>
<td class="org-left">Matematică</td>
</tr>

<tr>
<td class="org-left">Ciclul de studii</td>
<td class="org-left">Licență</td>
</tr>

<tr>
<td class="org-left">Programul de studii/Calificarea</td>
<td class="org-left">Matematică-Informatică</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-date-despre-disciplina" class="outline-3">
<h3 id="date-despre-disciplina">Date despre disciplină</h3>
<div class="outline-text-3" id="text-date-despre-disciplina">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Denumirea disciplinei</td>
<td class="org-left">Tehnici avansate de programare</td>
</tr>

<tr>
<td class="org-left">Titularul activităților de curs</td>
<td class="org-left">Lect. Dr. Marius Apetrii/Drd. Petru Rebeja</td>
</tr>

<tr>
<td class="org-left">Titularul activităților de seminar</td>
<td class="org-left">Lect. Dr. Marius Apetrii/Drd. Petru Rebeja</td>
</tr>

<tr>
<td class="org-left">An de studiu</td>
<td class="org-left">III</td>
</tr>

<tr>
<td class="org-left">Semestru</td>
<td class="org-left">IV</td>
</tr>

<tr>
<td class="org-left">Regimul disciplinei</td>
<td class="org-left">Opțional</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-evaluare" class="outline-3">
<h3 id="evaluare">Evaluare</h3>
<div class="outline-text-3" id="text-evaluare">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Tip activitate</th>
<th scope="col" class="org-left">Criterii de evaluare</th>
<th scope="col" class="org-left">Metode de evaluare</th>
<th scope="col" class="org-right">Pondere în nota finală</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Curs</td>
<td class="org-left">Cunoașterea și utilizarea corectă a noțiunilor și rezultatelor fundamentale</td>
<td class="org-left">2 teste (S3 şi S9)(<b>TS</b>)</td>
<td class="org-right">60%</td>
</tr>

<tr>
<td class="org-left">Laborator</td>
<td class="org-left">Implementarea corectă a rezultatelor teoretice</td>
<td class="org-left">Evaluarea portofoliului (teme+proiect)(<b>P</b>)</td>
<td class="org-right">40%</td>
</tr>
</tbody>
</table>
</div>
<div id="outline-container-orgab26d44" class="outline-4">
<h4 id="orgab26d44">Standard minim de performanță:</h4>
<div class="outline-text-4" id="text-orgab26d44">
\begin{equation}
TS \ge 5
\end{equation}
\begin{equation}
P \ge 5
\end{equation}
</div>
</div>
</div>

<div id="outline-container-bibliografie" class="outline-3">
<h3 id="bibliografie">Referințe bibliografice</h3>
<div class="outline-text-3" id="text-bibliografie">
<ol class="org-ol">
<li>Liviu Negrescu, Lavinia Negrescu, <b>Limbajul C# pentru începători</b>, Editura Albastră, 2011</li>
<li>Joseph Albahari, Ben Albahari, <b>C# 7.0 in a Nutshell: The Definitive Reference</b>, O'Reilly, 2017</li>
<li>Adam Freeman, <b>Pro ASP.NET Core MVC</b>, Apress, 2016</li>
<li>Adam Freeman, <b>Pro Entity Framework Core 2 for ASP.NET Core MVC</b>, Apress, 2018</li>
<li><a href="https://docs.microsoft.com/en-us/visualstudio/releases/2019/release-notes">Visual Studio 2019</a></li>
<li><a href="https://git-scm.com/">Manual Git Online</a></li>
<li>Robert C. Martin, <b>Design Principles and Design Patterns</b>, 2000</li>
<li>Martin Fowler, <b>Refactoring. Improving the Design of Existing Code</b>, Addison-Wesley, 2018</li>
<li><a href="https://www.martinfowler.com/microservices/">Martin Fowler, Colecția de articole despre microservicii</a></li>
</ol>
</div>
</div>
</div>
<div id="outline-container-contact" class="outline-2">
<h2 id="contact">Date de contact</h2>
<div class="outline-text-2" id="text-contact">
</div>
<div id="outline-container-marius-apetrii" class="outline-3">
<h3 id="marius-apetrii">Marius Apetrii</h3>
<div class="outline-text-3" id="text-marius-apetrii">
</div>
<div id="outline-container-orgcf2da56" class="outline-4">
<h4 id="orgcf2da56">Email</h4>
<div class="outline-text-4" id="text-orgcf2da56">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(concat <span style="color: #3e999f;">"mapetrii"</span> <span style="color: #3e999f;">"@uaic.ro"</span>)
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-petru-rebeja" class="outline-3">
<h3 id="petru-rebeja">Petru Rebeja</h3>
<div class="outline-text-3" id="text-petru-rebeja">
</div>
<div id="outline-container-org3ac3cab" class="outline-4">
<h4 id="org3ac3cab">Email</h4>
<div class="outline-text-4" id="text-org3ac3cab">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(concat <span style="color: #3e999f;">"petru"</span> <span style="color: #3e999f;">"."</span> <span style="color: #3e999f;">"rebeja"</span> <span style="color: #3e999f;">"@gmail.com"</span>)
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-s01" class="outline-2">
<h2 id="s01">Săptămâna 01</h2>
<div class="outline-text-2" id="text-s01">
</div>
<div id="outline-container-s01-curs" class="outline-3">
<h3 id="s01-curs">Curs</h3>
<div class="outline-text-3" id="text-s01-curs">
<p>
<b>Infrastructură și unelte</b>
</p>

<p>
La curs discutăm despre infrastructura și uneltele necesare pentru dezvoltarea aplicațiilor pe platforma <code>.net core</code>.
</p>

<p>
Prezentarea de la curs poate fi descărcată în format <a href="s01/curs-s01.pdf">pdf</a>.
</p>
</div>
</div>
</div>
<div id="outline-container-links" class="outline-2">
<h2 id="links">Legături utile</h2>
<div class="outline-text-2" id="text-links">
<ul class="org-ul">
<li><a href="https://guides.github.com/introduction/flow/">GitHub flow</a> &#x2014; o descriere a modului de lucru pe GitHub.</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Autor: Petru Rebeja</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
